Public Types | Public Member Functions | List of all members
ACAPI::Favorite::FavoriteManager Class Reference
Favorite Management
FavoriteManager class is the manager class for the Archicad Favorite Manager. More...
#include <Favorite.hpp>
 Inheritance diagram for ACAPI::Favorite::FavoriteManager:
 Public Types
enum class  | ConflictPolicy { ConflictPolicy::Error , ConflictPolicy::Skip , ConflictPolicy::OverwriteExisting , ConflictPolicy::RenameNew }
Options for handling conflicts while creating and importing favorites. More...
 Public Member Functions
Result< Favorite >  | GetFavoriteByName (const GS::UniString &name) const
Get a favorite by its name.
std::vector< Favorite >  | GetFavoritesByElementType (API_ElemType type) const
Get all favorites of a specific elem type.
std::vector< Favorite >  | GetAllFavorites () const
Get all favorites.
Result< FavoriteFolder >  | GetRootFolder () const
Get the root folder of the favorite manager.
Result< void >  | ExportFavorites (const std::vector< ACAPI::Favorite::Favorite > &favorites, const IO::Location &targetFolder) const
Export a list of favorites to XML files.
Result< void >  | ExportFavoritesToLegacyPRF (const std::vector< ACAPI::Favorite::Favorite > &favorites, IO::Location &targetFile) const
Export a list of favorites to a PRF file.
Result< void >  | ImportFavorites (const std::vector< IO::Location > &favoriteXMLs, ACAPI::Favorite::FavoriteManager::ConflictPolicy conflictPolicy, const std::optional< ACAPI::Favorite::FavoriteFolder > &targetOrKeep) const
Import favorites from specific XML files.
Result< void >  | ImportAllFavorites (const IO::Location &sourceFolder, ACAPI::Favorite::FavoriteManager::ConflictPolicy conflictPolicy, const std::optional< ACAPI::Favorite::FavoriteFolder > &targetOrKeep) const
Import all favorites from a specific folder.
Result< void >  | ImportFavoritesFromLegacyPRF (const IO::Location &prfFile, ACAPI::Favorite::FavoriteManager::ConflictPolicy conflictPolicy, const std::optional< ACAPI::Favorite::FavoriteFolder > &targetOrKeep) const
Import favorites from a specific PRF file.
Result< void >  | DeleteFavorite (const ACAPI::Favorite::Favorite &favorite) const
Delete a favorite.
Result< void >  | DeleteFavoriteFolder (const ACAPI::Favorite::FavoriteFolder &folder) const
Delete a favorite folder and its content recursively.
Result< ACAPI::Favorite::Favorite >  | CreateFavorite (const GS::UniString &name, const ACAPI::Favorite::FavoriteFolder &folder, const ACAPI::ElementDefault &defaultElem) const
Create a favorite with the given name and default.
Result< ACAPI::Favorite::Favorite >  | CreateFavorite (const GS::UniString &name, const ACAPI::Favorite::FavoriteFolder &folder, API_Element element, const std::optional< std::vector< API_SubElement > > &subElements, const std::optional< API_ElementMemo > &memo, const std::optional< API_Element > &markerElement, const std::optional< API_ElementMemo > &markerMemo, const std::optional< std::vector< API_Property > > &properties, const std::optional< std::vector< GS::Pair< API_Guid, API_Guid > > > &classifications, const std::optional< std::vector< API_ElemCategoryValue > > &elemCategoryValues) const
Create a favorite with the given name and element as the default.
Result< void >  | ChangeFavorite (const ACAPI::Favorite::Favorite &favorite, const ACAPI::ElementDefault &defaultElem) const
Change a favorite with the given default.
Result< void >  | ChangeFavorite (const ACAPI::Favorite::Favorite &favorite, API_Element element, const std::optional< std::vector< API_SubElement > > &subElements, const std::optional< API_ElementMemo > &memo, const std::optional< API_Element > &markerElement, const std::optional< API_ElementMemo > &markerMemo, const std::optional< std::vector< API_Property > > &properties, const std::optional< std::vector< GS::Pair< API_Guid, API_Guid > > > &classifications, const std::optional< std::vector< API_ElemCategoryValue > > &elemCategoryValues) const
Change a favorite with the given element and optional parameters.
Result< ACAPI::Favorite::FavoriteFolder >  | CreateFolder (const ACAPI::Favorite::FavoriteFolder &parent, const GS::UniString &name) const
Create a favorite folder with the given name.
Result< void >  | MoveFavorite (const ACAPI::Favorite::Favorite &favorite, const ACAPI::Favorite::FavoriteFolder &targetFolder) const
Move a favorite to a new folder.
Result< void >  | MoveFolder (const ACAPI::Favorite::FavoriteFolder &folder, const ACAPI::Favorite::FavoriteFolder &targetFolder) const
Move a favorite folder to a new folder.
Result< void >  | RenameFavorite (const ACAPI::Favorite::Favorite &favorite, const GS::UniString &newName) const
Rename a favorite.
Result< void >  | RenameFolder (const ACAPI::Favorite::FavoriteFolder &folder, const GS::UniString &newName) const
Rename a favorite folder.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
FavoriteManager class is the manager class for the Archicad Favorite Manager.
Since
Archicad 29
Member Function Documentation
◆ ChangeFavorite() [1/2]
 Result< void > ACAPI::Favorite::FavoriteManager::ChangeFavorite  |  ( |  const ACAPI::Favorite::Favorite & |  favorite,
|  API_Element |  element,
|  const std::optional< std::vector< API_SubElement > > & |  subElements,
|  const std::optional< API_ElementMemo > & |  memo,
|  const std::optional< API_Element > & |  markerElement,
|  const std::optional< API_ElementMemo > & |  markerMemo,
|  const std::optional< std::vector< API_Property > > & |  properties,
|  const std::optional< std::vector< GS::Pair< API_Guid, API_Guid > > > & |  classifications,
|  const std::optional< std::vector< API_ElemCategoryValue > > & |  elemCategoryValues ) const
Change a favorite with the given element and optional parameters.
Parameters
favorite | The favorite to change.
element | The new element of the favorite.
subElements | The new subelements of the element if needed.
memo | The new element memo of the element if needed.
markerElement | The new marker element of the element if needed.
markerMemo | The new element memo of the marker element if needed.
properties | The new properties of the element.
classifications | The new classifications of the element.
elemCategoryValues | The new element category values of the element.
Precondition
This function requires an opened NotUndoable command scope.
Returns
Success if the change is successful, otherwise an error.
◆ ChangeFavorite() [2/2]
 Result< void > ACAPI::Favorite::FavoriteManager::ChangeFavorite  |  ( |  const ACAPI::Favorite::Favorite & |  favorite,
|  const ACAPI::ElementDefault & |  defaultElem ) const
Change a favorite with the given default.
Parameters
favorite | The favorite to change.
defaultElem | The new default of the favorite.
Precondition
This function requires an opened NotUndoable command scope.
Returns
Success if the change is successful, otherwise an error.
◆ CreateFavorite() [1/2]
 Result< ACAPI::Favorite::Favorite > ACAPI::Favorite::FavoriteManager::CreateFavorite  |  ( |  const GS::UniString & |  name,
|  const ACAPI::Favorite::FavoriteFolder & |  folder,
|  API_Element |  element,
|  const std::optional< std::vector< API_SubElement > > & |  subElements,
|  const std::optional< API_ElementMemo > & |  memo,
|  const std::optional< API_Element > & |  markerElement,
|  const std::optional< API_ElementMemo > & |  markerMemo,
|  const std::optional< std::vector< API_Property > > & |  properties,
|  const std::optional< std::vector< GS::Pair< API_Guid, API_Guid > > > & |  classifications,
|  const std::optional< std::vector< API_ElemCategoryValue > > & |  elemCategoryValues ) const
Create a favorite with the given name and element as the default.
Parameters
name | The name of the favorite.
folder | The parent folder of the favorite.
element | The element as the default of the favorite.
subElements | The subelements of the element if needed.
memo | The element memo of the element if needed.
markerElement | The marker element of the element if needed.
markerMemo | The element memo of the marker element if needed.
properties | The properties of the element.
classifications | The classifications of the element.
elemCategoryValues | The element category values of the element.
Precondition
This function requires an opened NotUndoable command scope.
Returns
The created favorite if the creation is successful, otherwise an error.
◆ CreateFavorite() [2/2]
 Result< ACAPI::Favorite::Favorite > ACAPI::Favorite::FavoriteManager::CreateFavorite  |  ( |  const GS::UniString & |  name,
|  const ACAPI::Favorite::FavoriteFolder & |  folder,
|  const ACAPI::ElementDefault & |  defaultElem ) const
Create a favorite with the given name and default.
Parameters
name | The name of the favorite.
folder | The parent folder of the favorite.
defaultElem | The default of the favorite.
Precondition
This function requires an opened NotUndoable command scope.
Returns
The created favorite if the creation is successful, otherwise an error.
◆ CreateFolder()
 Result< ACAPI::Favorite::FavoriteFolder > ACAPI::Favorite::FavoriteManager::CreateFolder  |  ( |  const ACAPI::Favorite::FavoriteFolder & |  parent,
|  const GS::UniString & |  name ) const
Create a favorite folder with the given name.
Parameters
parent | The parent folder of the new folder.
name | The name of the new folder.
Precondition
This function requires an opened NotUndoable command scope.
Returns
The created favorite folder if the creation is successful, otherwise an error.
◆ DeleteFavorite()
 Result< void > ACAPI::Favorite::FavoriteManager::DeleteFavorite  |  ( |  const ACAPI::Favorite::Favorite & |  favorite | ) |   const
Delete a favorite.
Parameters
favorite | The favorite to delete.
Precondition
This function requires an opened NotUndoable command scope.
Returns
Success if the delete is successful, otherwise an error.
◆ DeleteFavoriteFolder()
 Result< void > ACAPI::Favorite::FavoriteManager::DeleteFavoriteFolder  |  ( |  const ACAPI::Favorite::FavoriteFolder & |  folder | ) |   const
Delete a favorite folder and its content recursively.
Parameters
folder | The favorite folder to delete.
Precondition
This function requires an opened NotUndoable command scope.
Returns
Success if the delete is successful, otherwise an error.
◆ ExportFavorites()
 Result< void > ACAPI::Favorite::FavoriteManager::ExportFavorites  |  ( |  const std::vector< ACAPI::Favorite::Favorite > & |  favorites,
|  const IO::Location & |  targetFolder ) const
Export a list of favorites to XML files.
Parameters
favorites | The list of favorites to export.
targetFolder | The target folder where the XML files will be saved.
Returns
Success if the export is successful, otherwise an error.
◆ ExportFavoritesToLegacyPRF()
 Result< void > ACAPI::Favorite::FavoriteManager::ExportFavoritesToLegacyPRF  |  ( |  const std::vector< ACAPI::Favorite::Favorite > & |  favorites,
|  IO::Location & |  targetFile ) const
Export a list of favorites to a PRF file.
Parameters
favorites | The list of favorites to export.
targetFile | The target PRF file. The file extension should be ".prf" or "pref".
Returns
Success if the export is successful, otherwise an error.
◆ GetAllFavorites()
 std::vector< Favorite > ACAPI::Favorite::FavoriteManager::GetAllFavorites  |  ( |   | ) |   const
Get all favorites.
Returns
Vector of all favorites.
◆ GetFavoriteByName()
 Result< Favorite > ACAPI::Favorite::FavoriteManager::GetFavoriteByName  |  ( |  const GS::UniString & |  name | ) |   const
Get a favorite by its name.
Parameters
name | The name of the favorite.
Returns
The favorite with the given name if it exists, otherwise an error.
◆ GetFavoritesByElementType()
 std::vector< Favorite > ACAPI::Favorite::FavoriteManager::GetFavoritesByElementType  |  ( |  API_ElemType |  type | ) |   const
Get all favorites of a specific elem type.
Parameters
type | The type of the favorites.
Returns
The favorites of the given type.
◆ GetRootFolder()
 Result< FavoriteFolder > ACAPI::Favorite::FavoriteManager::GetRootFolder  |  ( |   | ) |   const
Get the root folder of the favorite manager.
Returns
The root folder of the favorite manager.
◆ ImportAllFavorites()
 Result< void > ACAPI::Favorite::FavoriteManager::ImportAllFavorites  |  ( |  const IO::Location & |  sourceFolder,
|  ACAPI::Favorite::FavoriteManager::ConflictPolicy |  conflictPolicy,
|  const std::optional< ACAPI::Favorite::FavoriteFolder > & |  targetOrKeep ) const
Import all favorites from a specific folder.
Parameters
sourceFolder | The source folder where the favorites are located.
conflictPolicy | The conflict policy to handle name conflicts.
targetOrKeep | The target folder where the favorites will be imported. If it is empty, the favorites will be imported to the root folder.
Precondition
This function requires an opened NotUndoable command scope.
Returns
Success if the import is successful, otherwise an error.
◆ ImportFavorites()
 Result< void > ACAPI::Favorite::FavoriteManager::ImportFavorites  |  ( |  const std::vector< IO::Location > & |  favoriteXMLs,
|  ACAPI::Favorite::FavoriteManager::ConflictPolicy |  conflictPolicy,
|  const std::optional< ACAPI::Favorite::FavoriteFolder > & |  targetOrKeep ) const
Import favorites from specific XML files.
Parameters
favoriteXMLs | The list of XML files to import.
conflictPolicy | The conflict policy to handle name conflicts.
targetOrKeep | The target folder where the favorites will be imported. If it is empty, the favorites will be imported to the root folder.
Precondition
This function requires an opened NotUndoable command scope.
Returns
Success if the import is successful, otherwise an error.
◆ ImportFavoritesFromLegacyPRF()
 Result< void > ACAPI::Favorite::FavoriteManager::ImportFavoritesFromLegacyPRF  |  ( |  const IO::Location & |  prfFile,
|  ACAPI::Favorite::FavoriteManager::ConflictPolicy |  conflictPolicy,
|  const std::optional< ACAPI::Favorite::FavoriteFolder > & |  targetOrKeep ) const
Import favorites from a specific PRF file.
Parameters
prfFile | The PRF file to import.
conflictPolicy | The conflict policy to handle name conflicts.
targetOrKeep | The target folder where the favorites will be imported. If it is empty, the favorites will be imported to the root folder.
Precondition
This function requires an opened NotUndoable command scope.
Returns
Success if the import is successful, otherwise an error.
◆ MoveFavorite()
 Result< void > ACAPI::Favorite::FavoriteManager::MoveFavorite  |  ( |  const ACAPI::Favorite::Favorite & |  favorite,
|  const ACAPI::Favorite::FavoriteFolder & |  targetFolder ) const
Move a favorite to a new folder.
Parameters
favorite | The favorite to move.
targetFolder | The target folder where the favorite will be moved.
Precondition
This function requires an opened NotUndoable command scope.
Returns
Success if the move is successful, otherwise an error.
◆ MoveFolder()
 Result< void > ACAPI::Favorite::FavoriteManager::MoveFolder  |  ( |  const ACAPI::Favorite::FavoriteFolder & |  folder,
|  const ACAPI::Favorite::FavoriteFolder & |  targetFolder ) const
Move a favorite folder to a new folder.
Parameters
folder | The folder to move.
targetFolder | The target folder where the folder will be moved.
Precondition
This function requires an opened NotUndoable command scope.
Returns
Success if the move is successful, otherwise an error.
◆ RenameFavorite()
 Result< void > ACAPI::Favorite::FavoriteManager::RenameFavorite  |  ( |  const ACAPI::Favorite::Favorite & |  favorite,
|  const GS::UniString & |  newName ) const
Rename a favorite.
Parameters
favorite | The favorite to rename.
newName | The new name of the favorite.
Precondition
This function requires an opened NotUndoable command scope.
Returns
Success if the rename is successful, otherwise an error.
◆ RenameFolder()
 Result< void > ACAPI::Favorite::FavoriteManager::RenameFolder  |  ( |  const ACAPI::Favorite::FavoriteFolder & |  folder,
|  const GS::UniString & |  newName ) const
Rename a favorite folder.
Parameters
folder | The folder to rename.
newName | The new name of the folder.
Precondition
This function requires an opened NotUndoable command scope.
Returns
Success if the rename is successful, otherwise an error.